SpenceKonde/ATTinyCore/avr/cores/tiny/wiring.c
/* This attempts to grab a tuning constant from flash (if it's USING_BOOTLOADER) or EEPROM (if not). Note that it is not called unless ENABLE_TUNING is set.
 * inlined for flash savings (call overhead) not speed; it is only ever called once, on startup, so I think it would get inlined anyway most of the time
 * addresses for key values:
 * FLASHEND is second byte of bootloader version, FLASHEND-1 is first byte. (all_
 * OFFSET:   Normal:  PLLs:   x41:          1634/828:
 * LASTCAL-0   12.8    16.5   16.0 @ 5V0    12.8 @ 5V0
 * LASTCAL-1   12.0    16.0   12.8 @ 5V0    12.0 @ 5V0
 * LASTCAL-2    8.0   CUSTOM  12.0 @ 5V0     8.0 @ 5V0
 * LASTCAL-3  CUSTOM   0x00   CUST/0x00     CUSTOM
 * LASTCAL-4
 * LASTCAL-5                  0x00
 *
 * Note that a "tuned" value os 0x00 or 0xFF is never treated as acceptable except for 0xFF in the case of 16 MHz tuning for x41.
 *
 * ENABLE_TUNING values:
 * 1 = use for required changes (it started app boot-tuned wrong, so we need to fix it, or we wanted tuned frequency like 12 or 16.5 from non-bootloaded.
 * 2 = use stored cal contents for 8 MHz even if we start up like that.
 * 4 = enable custom tuning (CUST slot above - we make no promises about any timekeeping functions)
 * 8 = paranoid - don't trust that boot tuning actually happened
 */
#if USING_BOOTLOADER
  #define read_tuning_byte(x) pgm_read_byte_near(x)
  #define LASTCAL FLASHEND
#else // without a bootloader, we have to store calibration in the EEPROM
  #define read_tuning_byte(x) eeprom_read_byte((uint8_t*) x)
  #define LASTCAL E2END
#endif

#if defined(__SPM_REG)
  uint8_t read_factory_calibration(void) {
    uint8_t value = boot_signature_byte_get(1);
    return value;
  }
#endif

// only called in one place most likely, but we'll try to make sure the compiler inlines it just the same. It's 3 instructions, so it absolutely ought to be.
inline void __attribute__((always_inline)) set_OSCCAL(uint8_t cal) {
  #ifdef OSCCAL0
    OSCCAL0 = cal;
  #else
    OSCCAL = cal;
  #endif
  __asm__ __volatile__ ("nop" "\n\t"); /* This is the "trick" that micronucleus uses to avoid crashes from sudden frequency change. Since micronucleus works, I'll copy that trick. */
}

static inline bool __attribute__((always_inline)) check_tuning() {
  // It is almost inconceivable that 0 would be the desired tuning
  // If this is still 0 by the end, we didn't have a valid tuning constant.
  uint8_t tuneval = 0;
  #if (CLOCK_SOURCE == 6)
  /* start PLL timer tuning */
    #if (F_CPU == 16500000)
      tuneval = read_tuning_byte(LASTCAL - 0);
    #elif (F_CPU == 16000000 || F_CPU == 8000000 || F_CPU) // 16 or divided down 16.
      tuneval = read_tuning_byte(LASTCAL - 1);
    #else // Custom tuning
      tuneval = read_tuning_byte(LASTCAL - 2);
    #endif
  /* end PLL timer tuning */
  #elif (CLOCK_SOURCE == 0)
  /* start internal tuning */
    #if defined(__AVR_ATtinyX41__)
      // 441/841 can be pushed all the way to 16!!
      #if  (F_CPU == 16000000) // 16 MHz - crazy internal oscillator, no?
        uint8_t tune8 = read_tuning_byte(LASTCAL - 3)
        if (tune8 != 0xFF)
          // Need this specific test because 0xFF is valid tuning here
          // everywhere else, we assume 0xFF means no tuning saved.
          tuneval = read_tuning_byte(LASTCAL - 0);
          // if tuning stored is 0, then tuner determined that chip can't get to 16. or even within 2%.
          // return success, but tune for 8 MHz, because otherwise the routine would think it meant no tuning stored
          // and guess - likely resulting in broken 15.x clock. Tuned to 8, they have more chance to figure out what
          // happened, and user code can check for OSCCAL < 128 - that would mean the chip isn't tuned to 16.
          // docs will advise that if ENABLE_TUNING is defined, F_CPU is 16 MHz and OSCCAL0 < 128, that means that
          // the chip in question can't hit 16, please use a different chip, and that they can halve the serial
          // baud to see what it's printing to serial. On the other hand, if F_CPU is 16 MHz, OSCCAL0 > 128, whether
          // or not ENABLE_TUNING is defined, if it's not running close enough to 16 for serial to work, it guessed at
          // cal because no tuning or not enabled, and the guess didn't work; running tuning sketch should fix it.;
          set_OSCCAL(tuneval != 0 ? tuneval : tune8);
          return 1;
        } else {
          uint8_t osccal=OSCCAL0;
          if (osccal < 82) {
            set_OSCCAL(OSCCAL0+174);
            return 1;
          } else if (osccal < 88) {
            set_OSCCAL(255);
            return 1;
          }
          return 0;
        }
      #elif (F_CPU == 12800000)
        tuneval = read_tuning_byte(LASTCAL - 1);
      #elif (F_CPU == 12000000)
        tuneval = read_tuning_byte(LASTCAL - 2);
      #elif (F_CPU ==  8000000 &&  defined(LOWERCAL)) // if LOWERCAL is defined user says Vcc is closer to 5v0, so use tuned cal.
        tuneval = read_tuning_byte(LASTCAL - 3);
      #elif (F_CPU ==  8000000 && !defined(LOWERCAL)) // if LOWERCAL is not defined user says Vcc is closer to 3v3, so use factory cal.
        // do nothing
      #else
        tuneval = read_tuning_byte(LASTCAL - 4);
      #endif
    #else
      // Everything else uses the same tuning locations
      #if   (F_CPU == 12800000)
        tuneval = read_tuning_byte(LASTCAL - 0);
      #elif (F_CPU == 12000000)
        tuneval = read_tuning_byte(LASTCAL - 1);
      #elif (F_CPU ==  8000000 && ( defined(LOWERCAL) || !(defined(__AVR_ATtiny1634__) || defined(__AVR_ATtiny828__))))
        // On those parts, oscillator frequency depends dramatically on voltage, but factory cal is very good at 3V3
        // If they say it's running at ~5V we define LOWERCAL, and we should use the (lower) tuned cal or guess if we
        // don't have such a constant stored.
        tuneval = read_tuning_byte(LASTCAL - 2);
      #elif (F_CPU ==  8000000 && (!defined(LOWERCAL) &&  (defined(__AVR_ATtiny1634__) || defined(__AVR_ATtiny828__))))
        // do nothing - user says Vcc is closer to 3v3, so factory cal is best.
      #else // Custom tuning
        tuneval = read_tuning_byte(LASTCAL - 3);
      #endif
    #endif
  /* end internal tuning */
  #else
  /* start non-tunable timer tuning */
    badCall("Call to check_tuning() detected, but we are using an external oscillator which we can't tune. This is a defect in ATTinyCore and should be reported to the developers promptly");
    return false;
  /* end non-tunable timer tuning */
  #endif
  #if (!defined(__AVR_ATtinyX41__) || F_CPU != 16000000)
    // Success here is special case handled above as 0xFF is not an unreasonable tuning value
    // otherwise 0 = above derermined it shouldn't be tuned, and 0xFF = no tuning constant present (blank flash/eeprom)
    if (tuneval != 0 && tuneval !=0xFF) {
      set_OSCCAL(tuneval);
      return 1;
    }
  #endif
  return 0;
}




