SpenceKonde/ATTinyCore/avr/cores/tiny/wiring.c
void init_clock() {
  /*  If clocked from the PLL (CLOCK_SOURCE == 6) then there are three special cases all involving
   *  the 16.5 MHz clock option used to support VUSB on PLL-clocked parts.
   *  If F_CPU is set to 16.5, and the Micronucleus bootloader is in use (indicated by BOOTTUNED165
   *  being defined), the bootloader has already set OSCCAL to run at 16.5; if the board was told
   *  that was the context it would be started in,
   *  If it is set to 16.5 but BOOTTUNED165 is not set, we're not using the micronucleus bootloader
   *  and we need to increase OSCCAL; this is a guess, but works better than nothing.
   *
   *  Note that this horrendous mess gets preprocessed down to only a couple of lines. check_tuning()
   *  is only called once, at most, which is why we inline it.
   */

  #if (CLOCK_SOURCE == 6)
    /* Start PLL prescale and tuning */
    #if (defined(BOOTTUNED165))       // If it's a micronucleus board, it will either run at 16.5 after
                                      // adjusting the internal oscillator for that speed (in which case
                                      // we are done) or we want it to be set to run at 16.
      #if (F_CPU == 16000000L || F_CPU == 8000000L || F_CPU == 4000000L || F_CPU == 2000000L || F_CPU == 1000000L || F_CPU == 500000L || F_CPU == 250000L || F_CPU == 125000L || F_CPU == 62500L )
        #if defined(ENABLE_TUNING)  && (ENABLE_TUNING & 3)
                                      // This is "necessary" tuning, if ENABLE_TUNING & 1, we try to tune - unlike cases where we only tune if ENABLE_TUNING & 2 (tune always)
          if (!check_tuning())        // because it was tuned to a different speed than what we want by the bootloader (or we suspect it was)
        #endif                        // failing that, or if tuning isn't enabled in the first place we just get the factory cal.
          #if defined(__SPM_REG)
            set_OSCCAL(read_factory_calibration());
          #endif
        #if (F_CPU     != 16000000L)  // 16MHz is speed of unprescaled PLL clock - if we don't want that, means we want a prescaled one
          #ifdef CCP
            CCP=0xD8; //enable change of protected register
          #else
            CLKPR=1 << CLKPCE; //enable change of protected register
          #endif
          #if   (F_CPU ==  8000000L)
            CLKPR = 1;                // prescale by 2 for 8MHz
          #elif (F_CPU ==  4000000L)
            CLKPR = 2;                // prescale by 4 for 4MHz
          #elif (F_CPU ==  2000000L)
            CLKPR = 3;                // prescale by 8 for 2MHz
          #elif (F_CPU ==  1000000L)
            CLKPR = 4;                // prescale by 16 for 1MHz
          #elif (F_CPU ==   500000L)
            CLKPR = 5;                // prescale by 32 for 0.5MHz
          #elif (F_CPU ==   250000L)  // these extremely slow speeds are of questionable value.
            CLKPR = 6;                // prescale by 64 for 0.25MHz
          #elif (F_CPU ==   125000L)  // but if using micronucleus to get code onto chip, no choice
            CLKPR = 7;                // prescale by 128 for 125kHz
          #else // (F_CPU ==   62500L)  // This is far too slow for anything to work right!
            CLKPR = 8;                // prescale by 256 for 62.50kHz
          #endif
        #endif // Not 16 MHz
      #elif (F_CPU != 16500000L)  // second case - first was not 16.5 AND one of the normal ones - hence it's a custom tuning on a part that's starting
        #if defined(ENABLE_TUNING) && ((ENABLE_TUNING) & 4)   // from VUSB and tuned it's osc for 16.5... You know what a normal, every day occurrence that is right?
          check_tuning();   // if tuning is enabled for custom speed (ENABLE_TUNING & 4) - use tuned value - if we have one.
                            // If we don't, we're up a certain creek without a useful implement, as we don't know 'til runtime, when we can't tell the user!
        #else
          // If we're here, though, we didn't even have a boat because custom tuning is disabled, so we can tell them at compile time.
          #error "Requested PLL-derived frequency is a custom tuning, which is not enabled."
        #endif // end of check for custom tuning enabled.
      #else
        // Chip was tuned by bootloader to 16.5 MHz, and that's what we're telling it to run at - that was easy. But - if we're paranoid, we can get our stored one!
        #if defined(ENABLE_TUNING) && ((ENABLE_TUNING) & 8)
          check_tuning(); // Don't trust that boot tuning happened.
        #endif
      #endif
    #elif (F_CPU == 16500000L)    // not using a bootloader configured to leave OSC at 16.5 MHz - but that's what we want to run at...
      #if defined(ENABLE_TUNING) && ((ENABLE_TUNING) & 3) // if tuning is enabled, grab the tuning constant, if present
      if (!check_tuning())                                // and only grab default and guess if we didn't find one.
      #endif
      { // if that fails, or tuning isn't enabled, we do the guess :-/
        #if defined(__SPM_REG)
          if (OSCCAL == read_factory_calibration()) { // adjust the calibration up from 16.0mhz to 16.5mhz
            if (OSCCAL >= 128) {
              set_OSCCAL(OSCCAL + 7); // maybe 8 is better? oh well - only about 0.3% out anyway
            } else {
              set_OSCCAL(OSCCAL + 5);
            }
          }
        #else
          if (OSCCAL >= 128) {
            set_OSCCAL(OSCCAL + 7); // maybe 8 is better? oh well - only about 0.3% out anyway
          } else {
            set_OSCCAL(OSCCAL + 5);
          }
        #endif
      }
    #else // We're using PLL, and we are neither tuned to nor seeking 16.5...
      #if (F_CPU == 16000000L || F_CPU == 8000000L || F_CPU == 4000000L || F_CPU == 2000000L || F_CPU == 1000000L || F_CPU == 500000L || F_CPU == 250000L || F_CPU == 125000L || F_CPU == 62500L )
        #if defined(ENABLE_TUNING) && ((ENABLE_TUNING) & 2) // if we 'always tune' (ENABLE_TUNING == 2)
          check_tuning();      // Use tuned value if set to always tune, otherwise assume factory tuning is OK.
        #endif
        // 16MHz is speed of unprescaled PLL clock.
        #if     (F_CPU != 16000000)
          #ifdef CCP
            CCP   = 0xD8; // enable change of protected register
          #else
            CLKPR = (1 << CLKPCE); // enable change of protected register
          #endif
          // One really wonders why someone would use the PLL as clock source if they weren't using VUSB or running at 16MHz, it's got to burn more power...
          #if   (F_CPU ==  8000000L)
            CLKPR = 1;                // prescale by 2 for 8MHz
          #elif (F_CPU ==  4000000L)
            CLKPR = 2;                // prescale by 4 for 4MHz
          #elif (F_CPU ==  2000000L)  // could also be done with fuses, but this is such a weird situation,
            CLKPR = 3;                // prescale by 8 for 2MHz
          #elif (F_CPU ==  1000000L)
            CLKPR = 4;                // prescale by 16 for 1MHz
          #elif (F_CPU ==   500000L)
            CLKPR = 5;                // prescale by 32 for 0.5MHz
          #elif (F_CPU ==   250000L)  // these extremely slow speeds are of questionable value.
            CLKPR = 6;                // prescale by 64 for 0.25MHz
          #elif (F_CPU ==   125000L)
            CLKPR = 7;                // prescale by 128 for 125kHz
          #else// (F_CPU ==   62500L)
            CLKPR = 8; // prescale by 256 for 62.50kHz
          #endif  // end of checking F_CPUs
        #endif    // end not 16 MHz
      #else // else not one of 16 MHz derived ones
        #if defined(ENABLE_TUNING) && ((ENABLE_TUNING) & 4)
          check_tuning(); // if tuning is enabled for custom speed (ENABLE_TUNING & 4)
        #else             // Use tuned value - if we have one.
          #error "Requested PLL-derived frequency is a custom tuning, which is not enabled."
        #endif // end of check for custom tuning enabled.
      #endif // end if not 16 MHz derived
    #endif // end check for VUSB-related special cases for the PLL
  /* End of PLL prescale and tuning */
  #elif (CLOCK_SOURCE == 0) // system clock is internal, so we may want to tune it, or it may be boot tuned.
    /* Start internal osc prescale and tuning */
    #if (F_CPU == 8000000L || F_CPU == 4000000L || F_CPU == 2000000L || F_CPU == 1000000L || F_CPU == 500000L || F_CPU == 250000L || F_CPU == 125000L || F_CPU == 62500L || F_CPU == 31250L)
      #if defined(__SPM_REG)
        // on parts without self programming no bootloader can set the speed. This whole section is skipped because on the one part like this, we do not support these weird clocks.
        #if (defined(BOOTTUNED128) || defined(BOOTTUNED120) || defined(BOOTTUNED160))
          // if the bootloader tuned for 12, 12.8, or even 16, but we want a normal speed,  grab the cal byte if enabled and we have it, otherwise grab default cal.
          #if defined(ENABLE_TUNING)  && (ENABLE_TUNING & 3)  // necessary tuning, if ENABLE_TUNING & 3, we try to tune - unlike cases where we only check ENABLE_TUNING & 2 (tune always)
            if (!check_tuning())  // try to use stored calibration
          #endif
          #if defined(LOWERCAL)   // means it is 1634, 828, or 441/841 so we probably have LOWERCAL set (if running at 5V it should be). Use it to guess at correct cal.
            set_OSCCAL(read_factory_calibration() - LOWERCAL);
          #else
            set_OSCCAL(read_factory_calibration());
          #endif
        #else
          // bootloader hasn't tuned it, and it's a normal frequency. Use tuning if set to always tune, otherwise don't do anything.
          // BUT if LOWERCAL is defined, that means it is 1634, 828, or 441/841 and running at 5V, treat as "necessary" tuning
          // and use LOWERCAL to adjust factory cal if no tuning.
          #if defined(ENABLE_TUNING) && (((ENABLE_TUNING) & 2) || (defined(LOWERCAL) && (ENABLE_TUNING & 3)))
            if (!check_tuning())  // try to use stored calibration
          #endif
          #if defined(LOWERCAL)
              set_OSCCAL(read_factory_calibration() - LOWERCAL);
          #else
              set_OSCCAL(read_factory_calibration());
          #endif
        #endif
      #endif
      // apply prescaling to get desired frequency if not set by fuses
      #if (F_CPU != 8000000L && F_CPU != 1000000L)
        // normal oscillator, and we want a setting that fuses won't give us,
        // so need to set prescale.
        #ifdef CCP
          CCP=0xD8; //enable change of protected register
        #else
          CLKPR=1 << CLKPCE; //enable change of protected register
        #endif
        // One really wonders why someone would use the PLL as clock source if they weren't using VUSB or running at 16MHz, it's got to burn more power...
        #if (F_CPU ==8000000L)
          CLKPR=1; //prescale by 2 for 8MHz
        #elif (F_CPU==4000000L)
          CLKPR=2; //prescale by 4 for 4MHz
        #elif (F_CPU==2000000L)
          CLKPR=3; //prescale by 8 for 2MHz
        #elif (F_CPU==1000000L)
          CLKPR=4; //prescale by 16 for 1MHz
        #elif (F_CPU ==500000L)
          CLKPR=5; //prescale by 32 for 0.5MHz
        #elif (F_CPU ==250000L) // these extremely slow speeds are of questionable value.
          CLKPR=6; //prescale by 64 for 0.25MHz
        #elif (F_CPU ==125000L) //
          CLKPR=7; //prescale by 128 for 125kHz
        #elif (F_CPU ==62500L)
          CLKPR=8; //prescale by 256 for 62.50kHz
        #else
          CLKPR = 8;                // prescale by 256 for 31.25kHz
        #endif
      #endif // End if not 1/8 MHz
    #elif (F_CPU == 12800000 || F_CPU == 12000000 || F_CPU == 16000000)
      // we want a 12.8, 12, or 16 MHz (the non-custom tuning frequencies)
      #if F_CPU == 16000000
        #if !defined(__AVR_ATtinyX41__)
          #error "Only 841/441 can reach 16 MHz with internal oscillator"
        #elif defined(BOOTTUNED160)
          // boot tuned to desired frequency, don't need to do anything unless paranoid tuning.
          #if defined(ENABLE_TUNING) && (ENABLE_TUNING & 8)
            check_tuning(); // Don't trust that boot tuning happened; maybe it may get uploaded with programmer (paranoid tuning)
          #endif
        #else
          #if defined(ENABLE_TUNING)  && (ENABLE_TUNING & 3)  // necessary tuning, if ENABLE_TUNING & 3, we try to tune - unlike cases where we only check ENABLE_TUNING & 2 (tune always)
            if (!check_tuning())      // here it started up at one tuned speed, we want a speed that isn't tuned.
          #endif
          {
            // since we're only working with one chip with a non-split osc, *sigh* we can guess....
          }
        #endif
      #elif (F_CPU == 12800000 && defined(BOOTTUNED128)) || (F_CPU == 12000000 && defined(BOOTTUNED120))
        // boot tuned to desired frequency, don't need to do anything unless paranoid tuning.
        #if defined(ENABLE_TUNING) && (ENABLE_TUNING & 8)
          check_tuning(); // Don't trust that boot tuning happened; maybe it may get uploaded with programmer (paranoid tuning)
        #endif
      #else // 12.8 or 12.0 without boot tuning, so we use the tuning constants.
        #if defined(ENABLE_TUNING) && (ENABLE_TUNING & 3)  // necessary tuning, if ENABLE_TUNING & 3, we try to tune - unlike cases where we only check ENABLE_TUNING & 2 (tune always)
          check_tuning();      // here it started up at one tuned speed, we want a speed that isn't tuned.
        #else
          // can't make a general guess here, due to the high/low split in OSCCAL and variety of parts
          #error "The selected frequency requires tuning or a bootloader that leaves internal so tuned."
        #endif
      #endif
    #else
      CLKPR=1 << CLKPCE; //enable change of protected register
    #endif
    /* End of internal osc prescale and tuning */
  #elif (CLOCK_SOURCE == 0x11 || CLOCK_SOURCE == 0x12)
    // external 16MHz CLOCK or Crystal, but maybe they want to go slower to save power...
    // This is used only for board definitions where the crystal is forced to be 16 MHz and nothing else.
    // That is, on Micronucleus boards that use it for the bootloader. Many people use these as just an easy way
    // to program the part, and want to use them at low voltages or for low power applications after uploading
    // code via USB, so the answer of "use an appropriate crystal then" doesn't hold water. That, by the way
    // is my answer to anyone who wants this support for other crystal speeds.
    // Used for the commercially available MH-ET tiny88 (16 MHz external clock) and Digispark Pro
    /* Start of 16 MHz external with prescale */
    #if     (F_CPU != 16000000) // 16MHz is speed of external clock on these
      #ifdef CCP
        CCP=0xD8; //enable change of protected register
      #else
        CLKPR=1 << CLKPCE; //enable change of protected register
      #endif
      #if (F_CPU ==8000000L)
        CLKPR=1; //prescale by 2 for 8MHz
      #elif (F_CPU==4000000L)
        CLKPR=2; //prescale by 4 for 4MHz
      #elif (F_CPU==2000000L)
        CLKPR=3; //prescale by 8 for 2MHz
      #elif (F_CPU==1000000L)
        CLKPR=4; //prescale by 16 for 1MHz
      #elif (F_CPU ==500000L)
        CLKPR=5; //prescale by 32 for 0.5MHz
      #elif (F_CPU ==250000L) // these extremely slow speeds are of questionable value.
        CLKPR=6; //prescale by 64 for 0.25MHz
      #elif (F_CPU ==125000L) //
        CLKPR=7; //prescale by 128 for 125kHz
      #elif (F_CPU ==62500L)
        CLKPR=8; //prescale by 256 for 62.50kHz
      #else
        #error "Frequency requested from 16MHz external clock that cannot be generated by prescaling"
      #endif //end handling of individual frequencies
    #endif //end if not 16 MHz (default speed)
  #endif //end handling for the two types of internal oscillator derived clock source and 16MHz ext clock of MH-ET tiny88
}
void init() {
  init_clock(); // initialize the main system clock
  #ifdef SET_REMAP
    REMAP = SET_REMAP;
  #endif
  #ifdef SET_REMAPUSI
    USIPP = 1
  #endif
  /* Initialize Primary Timer */
  #if (TIMER_TO_USE_FOR_MILLIS == 0)
    #if defined(WGM01) // if Timer0 has PWM
      TCCR0A = (1 << WGM01) | (1 << WGM00);
    #endif
    #if defined(TCCR0B) //The x61 has a wacky Timer0!
      TCCR0B = (MillisTimer_Prescale_Index << CS00);

    #elif defined(TCCR0A)  // Tiny x8 has no PWM from timer0
      TCCR0A = (MillisTimer_Prescale_Index << CS00);
    #else // tiny26 has no TCCR0A at all, only TCCR0
      TCCR0 = (MillisTimer_Prescale_Index << CS00);
    #endif
  #elif (TIMER_TO_USE_FOR_MILLIS == 1) && defined(TCCR1) //ATtiny x5
    TCCR1 = (1 << CTC1) | (1 << PWM1A) | (MillisTimer_Prescale_Index << CS10);
    GTCCR = (1 << PWM1B);
    OCR1C = 0xFF; //Use 255 as the top to match with the others as this module doesn't have a 8bit PWM mode.
  #elif (TIMER_TO_USE_FOR_MILLIS == 1) && defined(TCCR1E) //ATtiny x61
    TCCR1C = 1 << PWM1D;
    TCCR1B = (MillisTimer_Prescale_Index << CS10);
    TCCR1A = (1 << PWM1A) | (1 << PWM1B);
    //cbi(TCCR1E, WGM10); //fast pwm mode
    //cbi(TCCR1E, WGM11);
    OCR1C = 0xFF; //Use 255 as the top to match with the others as this module doesn't have a 8bit PWM mode.
  #elif (TIMER_TO_USE_FOR_MILLIS == 1)
    TCCR1A = 1 << WGM10;
    TCCR1B = (1 << WGM12) | (MillisTimer_Prescale_Index << CS10);
  #endif

  // this needs to be called before setup() or some functions won't work there
  sei();

  #ifndef DISABLEMILLIS
    // Enable the overflow interrupt (this is the basic system tic-toc for millis)
    #if defined(TIMSK) && defined(TOIE0) && (TIMER_TO_USE_FOR_MILLIS == 0)
      sbi(TIMSK, TOIE0);
    #elif defined(TIMSK0) && defined(TOIE0) && (TIMER_TO_USE_FOR_MILLIS == 0)
      sbi(TIMSK0, TOIE0);
    #elif defined(TIMSK) && defined(TOIE1) && (TIMER_TO_USE_FOR_MILLIS == 1)
      sbi(TIMSK, TOIE1);
    #elif defined(TIMSK1) && defined(TOIE1) && (TIMER_TO_USE_FOR_MILLIS == 1)
      sbi(TIMSK1, TOIE1);
    #else
      #error Millis() Timer overflow interrupt not set correctly
    #endif
  #endif
  #if defined(PLLTIMER1) && (!defined(PLLCSR))
    #error "Chip does not have PLL (only x5, x61 series do), yet you somehow selected PLL as timer1 source. If you have not modified the core, please report this to core maintainer."
  #endif
  #ifdef PLLTIMER1 // option on x5 and x61
    if (!PLLCSR) {
      PLLCSR = (1 << PLLE);
        while (!(PLLCSR&1)) {
          ; //wait for lock
        }
      PLLCSR = (1 << PCKE) | (1 << PLLE);
    }
  #endif
  #if defined(LOWPLLTIMER1) && ((CLOCK_SOURCE==6) || (!defined(PLLCSR)))
    #error "LOW SPEED PLL Timer1 clock source is NOT SUPPORTED when PLL is used as system clock source; the bit to enable it cannot be set, per datasheet (section Timer/Counter1->Register Descriotion->PLLCSR, x5 / x61 only) or chip does not have PLL"
  #endif
  #ifdef LOWPLLTIMER1 // option on x5 and x61
    if (!PLLCSR) {
      PLLCSR = (1 << LSM) | (1 << PLLE);
      while (!(PLLCSR&1)) {
        ; //wait for lock
      }
      // faster than |= since we know the value we want (OUT vs )
      PLLCSR = (1 << PCKE) | (1 << LSM) | (1 << PLLE);
    }
  #endif
  // Initialize the timer used for Tone
  #if INITIALIZE_SECONDARY_TIMERS
    initToneTimerInternal();
  #endif

  // Initialize the ADC
  #if defined(INITIALIZE_ADC) && INITIALIZE_ADC
    #if defined(ADCSRA)
      // set a2d prescale factor
      // ADCSRA = (ADCSRA & ~((1 << ADPS2) | (1 << ADPS1) | (1 << ADPS0))) | (ADC_ARDUINO_PRESCALER << ADPS0) | (1 << ADEN);
      // dude, this is being called on startup. We know that ADCSRA is 0! Why add a RMW cycle?!
      ADCSRA = (ADC_ARDUINO_PRESCALER << ADPS0) | (1 << ADEN);
      // enable a2d conversions
      // sbi(ADCSRA, ADEN); //we already set this!!!
    #endif
  #endif
}


/* Okay, timer registers:
 * It is arguable whether it's actually better to check for these - the way we're doing it in these files,
 * we are often not checking for features, but specific families of parts handled case-by-case, and there
 * will never be new classic AVRs released.... so why not just test for part families when that's what we're doing?
 *
 * TCCR1E is only on x61.
 * TCCR1D is only on x7 and x61.
 * TCCR1 is only on x5
 * All non-85 have TCCR1A.
 *
 * Check for COM0xn bits to know if TIMER0 has PWM (it doesn't on x61 (it's a weird timer there - can be 16-bit) or
 * the x8 (because they cheaped out)
 */
